
#Область ПрограммныйИнтерфейс

// Отправка уводмлений после создания/изменения/запуска задания для документа ВКМ_ОбслуживаниеКлиента
Процедура ОтправкаУведомленийВТелеграмЧат() Экспорт
	
	Выборка = Справочники.ВКМ_УведомленияТелеграмБоту.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Объект = Выборка.ПолучитьОбъект();
			
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,,ЗащищенноеСоединение);
		Ресурс = "bot" + Константы.ВКМ_ТокенУправленияТелеграммБотом.Получить() + "/sendMessage?chat_id=" +
			СтрЗаменить(Формат(Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить(), "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") +
			"&text= " + Объект.ТекстСообщения;
		
		Запрос = Новый HTTPЗапрос(Ресурс);
		Ответ = Соединение.Получить(Запрос);  
		
		Если Ответ.КодСостояния=200 Тогда
		    Объект.Удалить();
		Иначе
	    	ЗаписьЖурналаРегистрации("Отправка сообщения в чат Телеграм", УровеньЖурналаРегистрации.Ошибка,,,
	    		СтрШаблон("Ошибка при отправке сообщения: %1", Ответ.КодСостояния));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти