
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		ЗаполнитьГрафикНаСервере();
		ОбщегоНазначенияКлиент.СообщитьПользователю("График работы записан.");
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьГрафикНаСервере()

	ТекущийДень = Объект.Период.ДатаНачала;
	
	Пока ТекущийДень <= Объект.Период.ДатаОкончания Цикл
		ОтметкаРабочегоДня = ПроверитьОтметкуРабочегоДня(ТекущийДень);
		
		НаборЗаписей = РегистрыСведений.ВКМ_ГрафикРаботы.СоздатьМенеджерЗаписи();
		НаборЗаписей.Дата = ТекущийДень;
		НаборЗаписей.ГрафикРаботы = Объект.График;
		НаборЗаписей.Значение = ОтметкаРабочегоДня;
		НаборЗаписей.Записать(Истина);
		
		ТекущийДень = ТекущийДень + 86400;
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);	

КонецПроцедуры

&НаСервере
Функция ПроверитьОтметкуРабочегоДня(ТекущийДень)
	
	НомерДляНедели = ДеньНедели(ТекущийДень);
	
	Если НомерДляНедели = 1 Тогда
		ОтметкаРабочегоДня = ?(ДеньПонедельник, 1, 0);
	ИначеЕсли НомерДляНедели = 2 Тогда
		ОтметкаРабочегоДня = ?(ДеньВторник, 1, 0);
	ИначеЕсли НомерДляНедели = 3 Тогда
		ОтметкаРабочегоДня = ?(ДеньСреда, 1, 0);
	ИначеЕсли НомерДляНедели = 4 Тогда
		ОтметкаРабочегоДня = ?(ДеньЧетверг, 1, 0);
	ИначеЕсли НомерДляНедели = 5 Тогда
		ОтметкаРабочегоДня = ?(ДеньПятница, 1, 0);
	ИначеЕсли НомерДляНедели = 6 Тогда
		ОтметкаРабочегоДня = ?(ДеньСуббота, 1, 0);
	Иначе
		ОтметкаРабочегоДня = ?(ДеньВоскресенье, 1, 0);
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("Дата", ТекущийДень);
	РезультатПоиска = ПраздничныеДни.НайтиСтроки(ПараметрыОтбора);
	
	Если РезультатПоиска.Количество() = 0 Тогда
		Возврат ОтметкаРабочегоДня;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

#КонецОбласти