
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Год = НачалоГода(ТекущаяДатаСеанса());

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников 

&НаКлиенте
Процедура ОтпускаСотрудниковПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Строка = Элемент.ТекущиеДанные;
	
	Если Год(Строка.ДатаОкончания) <> Год(Объект.Год)
		ИЛИ Год(Строка.ДатаНачала) <> Год(Объект.Год) Тогда
		ТекстСообщения = СтрШаблон("В столбце даты отпусков год должен быть %1!", Формат(Год(Объект.Год), "ЧГ=0;"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Строка.ДатаОкончания = Неопределено;
		Строка.ДатаНачала = Неопределено;
		Возврат;
	КонецЕсли;
	
	Если Строка.ДатаНачала > Строка.ДатаОкончания Тогда
		ТекстСообщения = "Дата начала отпуска должна быть меньше даты окончания!";
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Строка.ДатаОкончания = Неопределено;
		Строка.ДатаНачала = Неопределено;
		Возврат;
	КонецЕсли;

	Строка.РазницаДней = ДеньГода(Строка.ДатаОкончания) - ДеньГода(Строка.ДатаНачала);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДиаграммаГанта(Команда)
	
	АдресХранилища = ПоместитьДанныеВоВременноеХранилище();
	ПараметрыПодбора = Новый Структура("АдресХранилища", АдресХранилища);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить());
	
КонецФункции

#КонецОбласти