#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьДокументыРеализации(Договоры, Ответственный) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Для Каждого Договор Из Договоры Цикл
		НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		НовыйДокумент.Организация = Договор.Организация;
		НовыйДокумент.Контрагент = Договор.Владелец;
		НовыйДокумент.Договор = Договор.Ссылка;
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Комментарий = "Документ создан из обработки ""Массовое создание актов (вкм)""";
		НовыйДокумент.Ответственный = Ответственный;
		НовыйДокумент.ВыполнитьАвтозаполнение();
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли