
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);

	ДиаграммаГанта.ОбластьЛегенды.Расположение = РасположениеЛегендыДиаграммы.Нет;
	ДиаграммаГанта.АвтоОпределениеПолногоИнтервала = Истина;
	Шкала = ДиаграммаГанта.ОбластьПостроения.ШкалаВремени.Элементы.Вставить(0);
	Шкала.Единица = ТипЕдиницыШкалыВремени.Неделя;
	Серия = ДиаграммаГанта.Серии.Добавить();

	Для Каждого Отпуск Из ОтпускаСотрудников Цикл
		Точка = ДиаграммаГанта.Точки.Добавить();
		Точка.Текст = Отпуск.Сотрудник;

		Интервал = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия).Добавить();
		Интервал.Цвет = ЦветаСтиля.ЦветМеткиСиний;
		Интервал.Начало = НачалоДня(Отпуск.ДатаНачала);
		Интервал.Конец = КонецДня(Отпуск.ДатаОкончания); 
	КонецЦикла;
	
//	ДиаграммаГанта.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти