#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ГрафикиОтпусков.Записывать = Истина;
	
	ДанныеДокумента = ПолучитьДанныеДокумента();
	
	Пока ДанныеДокумента.Следующий() Цикл
		Движение = Движения.ВКМ_ГрафикиОтпусков.Добавить();
		Движение.Период = НачалоГода(ДанныеДокумента.Год);
		Движение.Сотрудник = ДанныеДокумента.Сотрудник;
		Движение.ДатаНачала = ДанныеДокумента.ДатаНачала;
		Движение.ДатаОкончания = ДанныеДокумента.ДатаОкончания; 
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДокумента()

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка.Год,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
	|ГДЕ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

#КонецОбласти

#КонецЕсли