#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	
	СформироватьДвижения();
	РассчитатьОклад();	
	РассчитатьНДФЛ();	
	РассчитатьЗарплатуКВыплате();
	РассчитатьОтпуск();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИфункции


Процедура СформироватьДвижения() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ
	|	ВКМ_НачисленияЗарплаты.Сотрудник КАК Сотрудник,
	|	ВКМ_НачисленияЗарплаты.ВидРасчета КАК ВидРасчета,
	|	ВКМ_НачисленияЗарплаты.ДатаНачала КАК ПериодДействияНачало,
	|	ВКМ_НачисленияЗарплаты.ДатаОкончания КАК ПериодДействияОкончание,
	|	ВКМ_НачисленияЗарплаты.График КАК График,
	|	МАКСИМУМ(ВКМ_УсловияОплатыСотрудников.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ДанныеПоОкладам
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	|		ПО ВКМ_НачисленияЗарплаты.Сотрудник = ВКМ_УсловияОплатыСотрудников.Сотрудник
	|			И ВКМ_НачисленияЗарплаты.ДатаНачала >= ВКМ_УсловияОплатыСотрудников.Период
	|ГДЕ
	|	ВКМ_НачисленияЗарплаты.Ссылка = &Ссылка
	|	И ВКМ_НачисленияЗарплаты.ВидРасчета = &Оклад
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_НачисленияЗарплаты.Сотрудник,
	|	ВКМ_НачисленияЗарплаты.ВидРасчета,
	|	ВКМ_НачисленияЗарплаты.ДатаНачала,
	|	ВКМ_НачисленияЗарплаты.ДатаОкончания,
	|	ВКМ_НачисленияЗарплаты.График
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоОкладам.Сотрудник КАК Сотрудник,
	|	ВТ_ДанныеПоОкладам.ВидРасчета КАК ВидРасчета,
	|	ВТ_ДанныеПоОкладам.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ВТ_ДанныеПоОкладам.ПериодДействияОкончание КАК ПериодДействияКонец,
	|	ВТ_ДанныеПоОкладам.График КАК График,
	|	ВКМ_УсловияОплатыСотрудников.Оклад КАК Показатель,
	|	NULL КАК БазовыйПериодНачало,
	|	NULL КАК БазовыйПериодКонец
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
	|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПоОкладам КАК ВТ_ДанныеПоОкладам
	|		ПО (ВТ_ДанныеПоОкладам.Сотрудник = ВКМ_УсловияОплатыСотрудников.Сотрудник)
	|			И (ВТ_ДанныеПоОкладам.Период = ВКМ_УсловияОплатыСотрудников.Период)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_НачисленияЗарплаты.Сотрудник,
	|	ВКМ_НачисленияЗарплаты.ВидРасчета,
	|	ВКМ_НачисленияЗарплаты.ДатаНачала,
	|	ВКМ_НачисленияЗарплаты.ДатаОкончания,
	|	ВКМ_НачисленияЗарплаты.График,
	|	NULL,
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачисленияЗарплаты.ДатаНачала, МЕСЯЦ, -12), МЕСЯЦ),
	|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВКМ_НачисленияЗарплаты.ДатаНачала, МЕСЯЦ, -1), МЕСЯЦ)
	|ИЗ
	|	Документ.ВКМ_НачисленияЗарплаты.Начисления КАК ВКМ_НачисленияЗарплаты
	|ГДЕ
	|	ВКМ_НачисленияЗарплаты.Ссылка = &Ссылка
	|	И ВКМ_НачисленияЗарплаты.ВидРасчета = &Отпуск";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад); 
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 	
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = Выборка.ПериодДействияНачало;
		Движение.ПериодДействияКонец = Выборка.ПериодДействияКонец;
		Движение.ВидРасчета = Выборка.ВидРасчета;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.ГрафикРаботы = Выборка.График;
		Движение.Показатель = Выборка.Показатель;
		
		Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(Движение.ПериодДействияНачало, -12));
			Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(Движение.БазовыйПериодНачало, 11));
		КонецЕсли;
		
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодДействияНачало = Выборка.ПериодДействияНачало;
		Движение.ПериодДействияКонец = Выборка.ПериодДействияКонец;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	Движения.ВКМ_Удержания.Записать();

КонецПроцедуры

Процедура РассчитатьОклад() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	   |	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	   |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
	   |	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
	   |ИЗ
	   |	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
	   |			ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад)
	   |				И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки -1];
		
		Если Выборка.План = 0 Тогда
			ОбщегоНазначения.СообщитьПользователю("Не заполнен план графика сотрудника");
			Возврат;
		Иначе
			Движение.Сумма = Движение.Показатель * Выборка.Факт / Выборка.План; 
		КонецЕсли;
		
		Движение.Дней = Выборка.Факт/8;
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры

Процедура РассчитатьНДФЛ()
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	СУММА(База.СуммаБаза) КАК СуммаБаза,
	 |	База.НомерСтроки КАК НомерСтроки
	 |ИЗ
	 |	(ВЫБРАТЬ
	 |		ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	 |		ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	 |		ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.СуммаБаза КАК СуммаБаза,
	 |		ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки
	 |	ИЗ
	 |		РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(
	 |				&Измерения,
	 |				&Измерения,
	 |				,
	 |				ВидРасчета = &ВидРасчета
	 |					И Регистратор = &Ссылка) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления
	 |	
	 |	ОБЪЕДИНИТЬ ВСЕ
	 |	
	 |	ВЫБРАТЬ
	 |		ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.Сотрудник,
	 |		ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.ВидРасчета,
	 |		ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.СуммаБаза,
	 |		ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления.НомерСтроки
	 |	ИЗ
	 |		РегистрРасчета.ВКМ_Удержания.БазаВКМ_ДополнительныеНачисления(
	 |				&Измерения,
	 |				&Измерения,
	 |				,
	 |				ВидРасчета = &ВидРасчета
	 |					И Регистратор = &Ссылка) КАК ВКМ_УдержанияБазаВКМ_ДополнительныеНачисления) КАК База
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	База.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Запись = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		Запись.Сумма = (Выборка.СуммаБаза * 13) / 100; 
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать(, Истина);
	
КонецПроцедуры

Процедура РассчитатьЗарплатуКВыплате() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	   "ВЫБРАТЬ
	   |	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	   |	ЕСТЬNULL(ВКМ_ОсновныеНачисления.Сумма, 0) КАК Результат
	   |ПОМЕСТИТЬ ВТ_Начисления
	   |ИЗ
	   |	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	   |ГДЕ
	   |	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	   |
	   |ОБЪЕДИНИТЬ ВСЕ
	   |
	   |ВЫБРАТЬ
	   |	ВКМ_ДополнительныеНачисления.Сотрудник,
	   |	ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Сумма, 0)
	   |ИЗ
	   |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	   |ГДЕ
	   |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ВТ_Начисления.Сотрудник КАК Сотрудник,
	   |	СУММА(ВТ_Начисления.Результат) КАК Результат
	   |ПОМЕСТИТЬ ВТ_ГРуппировка
	   |ИЗ
	   |	ВТ_Начисления КАК ВТ_Начисления
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	ВТ_Начисления.Сотрудник
	   |;
	   |
	   |////////////////////////////////////////////////////////////////////////////////
	   |ВЫБРАТЬ
	   |	ВТ_ГРуппировка.Сотрудник КАК Сотрудник,
	   |	ВТ_ГРуппировка.Результат КАК Результат,
	   |	СУММА(ВКМ_Удержания.Сумма) КАК НДФЛ
	   |ИЗ
	   |	ВТ_ГРуппировка КАК ВТ_ГРуппировка
	   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	   |		ПО ВТ_ГРуппировка.Сотрудник = ВКМ_Удержания.Сотрудник
	   |ГДЕ
	   |	ВКМ_Удержания.Регистратор = &Ссылка
	   |
	   |СГРУППИРОВАТЬ ПО
	   |	ВТ_ГРуппировка.Сотрудник,
	   |	ВТ_ГРуппировка.Результат";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Результат - Выборка.НДФЛ;
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
	
КонецПроцедуры

Процедура РассчитатьОтпуск()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.СуммаБаза, 0) КАК РезультатБаза,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ДнейБаза, 0) КАК ОтработаноДнейБаза,
	|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт,
	|	ВКМ_ОсновныеНачисления.Сторно
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,,
	|			ВидРасчета = &Отпуск
	|		И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
	|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(ВидРасчета = &Отпуск
	|		И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск
	|	И ВКМ_ОсновныеНачисления.Регистратор = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	Измерения = Новый Массив; 
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки -1];
		Движение.Сумма = Выборка.РезультатБаза;
		Движение.Дней = Выборка.ОтработаноДнейБаза;  
		
		Если Движение.Сторно Тогда
			Движение.Дней = - Движение.Дней;
			Движение.Сумма = -Движение.Сумма;
		КонецЕсли;
		
	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли