
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	ЭлементДатаНачала = ВКМ_ПрограммноеСозданиеЭлементов.СозданиеПоляФормы(ЭтотОбъект, "ДатаНачала", Неопределено,,
		"Объект.ВКМ_ДатаНачала",,, "Дата начала (вкм)");
	ЭлементДатаОкончания = ВКМ_ПрограммноеСозданиеЭлементов.СозданиеПоляФормы(ЭтотОбъект, "ДатаОкончания", Неопределено,,
		"Объект.ВКМ_ДатаОкончания",,, "Дата окончания (вкм)");
	ЭлементСуммаАбонентскойПлаты = ВКМ_ПрограммноеСозданиеЭлементов.СозданиеПоляФормы(ЭтотОбъект,
		"СуммаАбонентскойПлаты", Неопределено,, "Объект.ВКМ_СуммаАбонентскойПлаты",,, "Сумма абонентской платы (вкм)");
	ЭлементСтоимостьЧасаРаботыСпециалиста = ВКМ_ПрограммноеСозданиеЭлементов.СозданиеПоляФормы(ЭтотОбъект,
		"СтоимостьЧасаРаботыСпециалиста", Неопределено,, "Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста",,,
		"Стоимость часа работы (вкм)");
		
	ПроверкаВидаДоговора();
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
//	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
//		
//		Если НЕ ЗначениеЗаполнено(Объект.ВКМ_ДатаНачала) Тогда
//			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""", Элементы.ДатаНачала.Заголовок);
//			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДатаНачала", "Объект.ВКМ_ДатаНачала", Отказ);
//		КонецЕсли;
//		
//		Если НЕ ЗначениеЗаполнено(Объект.ВКМ_ДатаОкончания) Тогда
//			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""", Элементы.ДатаОкончания.Заголовок);
//			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДатаОкончания", "Объект.ВКМ_ДатаОкончания",
//				Отказ);
//		КонецЕсли;
//		
//		Если НЕ ЗначениеЗаполнено(Объект.ВКМ_СуммаАбонентскойПлаты) Тогда
//			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""", Элементы.СуммаАбонентскойПлаты.Заголовок);
//			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СуммаАбонентскойПлаты",
//				"Объект.ВКМ_СуммаАбонентскойПлаты", Отказ);
//		КонецЕсли;
//		
//		Если НЕ ЗначениеЗаполнено(Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста) Тогда
//			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""", Элементы.СтоимостьЧасаРаботыСпециалиста.Заголовок);
//			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СтоимостьЧасаРаботыСпециалиста",
//				"Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста", Отказ);
//		КонецЕсли;
//		
//	КонецЕсли;
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	ПроверкаВидаДоговора();
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверкаВидаДоговора()
	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание Тогда
		Элементы.ДатаНачала.Видимость = Ложь;
		Элементы.ДатаОкончания.Видимость = Ложь;
		Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.СтоимостьЧасаРаботыСпециалиста.Видимость = Ложь;
		
		Объект.ВКМ_ДатаНачала = Неопределено;
		Объект.ВКМ_ДатаОкончания = Неопределено;
		Объект.ВКМ_СуммаАбонентскойПлаты = Неопределено;
		Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста = Неопределено;
	Иначе
		Элементы.ДатаНачала.Видимость = Истина;
		Элементы.ДатаОкончания.Видимость = Истина;
		Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.СтоимостьЧасаРаботыСпециалиста.Видимость = Истина;
	КонецЕсли;
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект
КонецПроцедуры

#КонецОбласти