
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	//++ a.demeshchenko 01.01.2025 netology Дипломный проект
	Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		
		Если НЕ ЗначениеЗаполнено(ВКМ_ДатаНачала) Тогда
//			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""", Элементы.ДатаНачала.Заголовок);
//			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДатаНачала", "Объект.ВКМ_ДатаНачала", Отказ);
//		КонецЕсли;
//		
//		Если НЕ ЗначениеЗаполнено(ВКМ_ДатаОкончания) Тогда
//			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""", Элементы.ДатаОкончания.Заголовок);
//			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "ДатаОкончания", "Объект.ВКМ_ДатаОкончания",
//				Отказ);
//		КонецЕсли;
//		
//		Если НЕ ЗначениеЗаполнено(ВКМ_СуммаАбонентскойПлаты) Тогда
//			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""", Элементы.СуммаАбонентскойПлаты.Заголовок);
//			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СуммаАбонентскойПлаты",
//				"Объект.ВКМ_СуммаАбонентскойПлаты", Отказ);
//		КонецЕсли;
//		
//		Если НЕ ЗначениеЗаполнено(ВКМ_СтоимостьЧасаРаботыСпециалиста) Тогда
//			ТекстСообщения = СтрШаблон("Не заполнено поле ""%1""", Элементы.СтоимостьЧасаРаботыСпециалиста.Заголовок);
//			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "СтоимостьЧасаРаботыСпециалиста",
//				"Объект.ВКМ_СтоимостьЧасаРаботыСпециалиста", Отказ);
		КонецЕсли;
		
	КонецЕсли;
	//-- a.demeshchenko 01.01.2025 netology Дипломный проект	

КонецПроцедуры

#КонецОбласти

#КонецЕсли