
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Год = Число(Формат(ТекущаяДатаСеанса(), "ЧГ=0; ДФ=yyyy;"));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УменьшитьГод(Команда)
	
	Год = Год - 1;

КонецПроцедуры

&НаКлиенте
Процедура ДобавтьГод(Команда)
	
	Год = Год + 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборМесяца(Команда)
	
	Месяц = Число(Прав(Команда.Имя, 2));
	Дата = Дата(Год, Месяц, 1);
	
	Оповестить(, Дата);
	Закрыть(Дата);

КонецПроцедуры

#КонецОбласти