
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьОтображениеПериода(ТекущаяДатаСеанса());
	ОбновитьТаблицуСпискаДокументов();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Параметр <> Неопределено Тогда
		Объект.Период = Параметр;
		ОбновитьОтображениеПериода(Объект.Период);
		ОбновитьТаблицуСпискаДокументов();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьМесяц(Команда)
	
	ОткрытьФорму("Обработка.ВКМ_МассовоеСозданиеАктов.Форма.ФормаВыборкаМесяца",,,,,,,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры


&НаКлиенте
Процедура СформироватьДокументыРеализации(Команда)
	
	Если Объект.СписокДокументов.Количество() = 0 Тогда
		ТекстПользователю = НСтр("ru='Отмена создания документов реализации. Договоры за выбранный месяц не найдены!'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстПользователю);
		Возврат;
	КонецЕсли;
	
	ДокументыДляОбработки = Объект.СписокДокументов;
	
	ДлительнаяОперация = ПолучитьДлительнуюОперацию(ДокументыДляОбработки);
	ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ПрогрессВыполнения", ЭтотОбъект);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеОкончанияОжидания", ЭтотОбъект);	
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = ОповещениеОПрогрессеВыполнения;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);	
		
	ОбновитьТаблицуСпискаДокументов();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтображениеПериода(Дата)
	
	Объект.Период = Дата;
	Элементы.ПериодТекст.Заголовок = Формат(Объект.Период, "ДФ='MMMM yyyy'");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуСпискаДокументов()
	
	Объект.СписокДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, ""Документ не сформирован"") КАК Реализация
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончания >= КОНЕЦПЕРИОДА(&Период, МЕСЯЦ)
	|	И ДоговорыКонтрагентов.ВКМ_ДатаНачала <= НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ)";
	
	Запрос.УстановитьПараметр("Период", Объект.Период);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СписокДокументов.Добавить();
		НоваяСтрока.Договор = Выборка.Договор;
		НоваяСтрока.Реализация = Выборка.Реализация;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДлительнуюОперацию(СписокДокументов)
	
	Договоры = Новый Массив;
	Ответственный = Пользователи.ТекущийПользователь();
	
	Для Каждого Строка Из СписокДокументов Цикл
		Если ТипЗнч(Строка.Реализация) <> Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Строка.Договор, "Ссылка,Организация,Владелец");
			Договоры.Добавить(РеквизитыДоговора);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения,
		"Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументыРеализации", Договоры, Ответственный);
		
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура ПрогрессВыполнения(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если Прогресс.Прогресс <> Неопределено Тогда
		Состояние("Идёт создание документов реализации.", Прогресс.Прогресс.Процент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОкончанияОжидания(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьТаблицуСпискаДокументов();
	
КонецПроцедуры

#КонецОбласти