
#Область СлужебныйПрограммныйИнтерфейс

Процедура СозданиеКнопкиКоманднойПанели(Форма, РодительКнопки, ИмяКнопкиИОбработчика, ЗаголовокКнопки,
	РазместитьПередИмяЭлемента="", Картинка = Неопределено, Отображение = Неопределено, НаименованиеОбщегоОбработчика = Неопределено) Экспорт
	Если НаименованиеОбщегоОбработчика <> Неопределено Тогда 
		НаименованиеОбработчика = НаименованиеОбщегоОбработчика;
	Иначе
		НаименованиеОбработчика = ИмяКнопкиИОбработчика;
	КонецЕсли;	
	Команда = Форма.Команды.Добавить(ИмяКнопкиИОбработчика);  
    Команда.Действие = НаименованиеОбработчика;       		
	Команда.Подсказка = ЗаголовокКнопки;
	Если РазместитьПередИмяЭлемента <> "" Тогда
		Кнопка = Форма.Элементы.Вставить(ИмяКнопкиИОбработчика, Тип("КнопкаФормы"), РодительКнопки, РодительКнопки.ПодчиненныеЭлементы[РазместитьПередИмяЭлемента]);       
	Иначе
		Кнопка = Форма.Элементы.Добавить(ИмяКнопкиИОбработчика, Тип("КнопкаФормы"), РодительКнопки);       
	КонецЕсли; 
	Кнопка.ИмяКоманды  = Команда.Имя;
	Кнопка.Заголовок = ЗаголовокКнопки; 
	Если Картинка <> Неопределено Тогда
		Кнопка.Картинка = Картинка;	
	КонецЕсли;	
	Если Отображение <> Неопределено Тогда
		Кнопка.Отображение = Отображение;
	КонецЕсли;			
КонецПроцедуры	

Функция СозданиеГруппыФормы(Форма, РодительГруппы, ВидГруппы, ИмяГруппы, НаименованиеГруппы="", РазместитьПередИмяЭлемента="", Группировка=Неопределено, Отображение=Неопределено) Экспорт
	Если РазместитьПередИмяЭлемента <> "" Тогда
		НоваяГруппа = Форма.Элементы.Вставить(ИмяГруппы, Тип("ГруппаФормы"), РодительГруппы, РодительГруппы.ПодчиненныеЭлементы[РазместитьПередИмяЭлемента]);       
	Иначе
		НоваяГруппа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), РодительГруппы); 
	КонецЕсли;		
	НоваяГруппа.Вид = ВидГруппы;
	НоваяГруппа.Заголовок = НаименованиеГруппы;
	Если НаименованиеГруппы = "" Тогда
		НоваяГруппа.ОтображатьЗаголовок = Ложь;
	КонецЕсли;	
	Если Группировка<>Неопределено Тогда
		НоваяГруппа.Группировка = Группировка;
	КонецЕсли;	
	Если Отображение <> Неопределено Тогда
		НоваяГруппа.Отображение = Отображение;
	КонецЕсли;	
	Возврат НоваяГруппа;
КонецФункции	

Процедура СозданиеКолонкиТаблицы(Форма, ИмяДинамическогоСписка, Реквизит, ТаблицаФормы)
	Если Реквизит = Неопределено Тогда 
		Возврат; 
	КонецЕсли;
	Если Строка(Реквизит.Поле) <> "ПараметрыДанных" Тогда
        Попытка
            НоваяКолонкаТаблицы = Форма.Элементы.Добавить("К_" + ИмяДинамическогоСписка + Строка(Реквизит.Поле), Тип("ПолеФормы"), ТаблицаФормы);    
            НоваяКолонкаТаблицы.ПутьКДанным = "" + ИмяДинамическогоСписка + "." + Строка(Реквизит.Поле);
        Исключение
            Сообщить(ОписаниеОшибки());
		КонецПопытки; 
	КонецЕсли;	
КонецПроцедуры

Функция ДобавитьКолонкуТЧ(Форма, ТаблицаФормы, ПутьКДанным, ВидПоля, ИмяПоля, ЗаголовокПоля, ПослеПоля = Неопределено, ТолькоПросмотр = Ложь) Экспорт
	ЭлементКолонка = Форма.Элементы.Вставить(ИмяПоля, Тип("ПолеФормы"), ТаблицаФормы, ПослеПоля);
	ЭлементКолонка.ПутьКДанным = ПутьКДанным;
	ЭлементКолонка.Вид = ВидПоля;
	ЭлементКолонка.Заголовок = ЗаголовокПоля;
	ЭлементКолонка.ТолькоПросмотр = ТолькоПросмотр;
	Возврат ЭлементКолонка;
КонецФункции	

Функция СозданиеТаблицыФормыСПроизвольнымЗапросом(Форма, РодительТаблицы, ИмяДинамическогоСписка, ТекстЗапроса, ПорядокКолонок="") Экспорт
	ТипыРеквизита = Новый Массив;
    ТипыРеквизита.Добавить(Тип("ДинамическийСписок"));
    ОписаниеТиповДляРеквизита = Новый ОписаниеТипов(ТипыРеквизита);
	ТаблЗначений = Новый РеквизитФормы(ИмяДинамическогоСписка, ОписаниеТиповДляРеквизита, , "", ложь);	
    ДобавляемыеРеквизиты = Новый Массив;
    ДобавляемыеРеквизиты.Добавить(ТаблЗначений);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);        
    РеквизитТаблЗначений = Форма[ИмяДинамическогоСписка];
	РеквизитТаблЗначений.ПроизвольныйЗапрос = Истина;
	РеквизитТаблЗначений.ТекстЗапроса = ТекстЗапроса;
    ТаблицаФормы = Форма.Элементы.Добавить("ф_" + ИмяДинамическогоСписка, Тип("ТаблицаФормы"), РодительТаблицы);
    ТаблицаФормы.ПутьКДанным = ИмяДинамическогоСписка;
	ДоступныеПоляОтбора = РеквизитТаблЗначений.Отбор.ДоступныеПоляОтбора;
	КоличествоРеквизитов = ДоступныеПоляОтбора.Элементы.Количество();
	Если ПорядокКолонок <> "" Тогда
		МассивКолонок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПорядокКолонок, ";");
		Для Каждого ИмяКолонки ИЗ МассивКолонок Цикл
			Реквизит = ДоступныеПоляОтбора.Элементы.Найти(ИмяКолонки);
			СозданиеКолонкиТаблицы(Форма, ИмяДинамическогоСписка, Реквизит, ТаблицаФормы);
		КонецЦикла;
	Иначе	
		Для ИндексРеквизита = 1 по КоличествоРеквизитов Цикл
			Реквизит = ДоступныеПоляОтбора.Элементы[КоличествоРеквизитов - ИндексРеквизита];
			СозданиеКолонкиТаблицы(Форма, ИмяДинамическогоСписка, Реквизит, ТаблицаФормы);	
		КонецЦикла;
	КонецЕсли;		
	Для каждого ПараметрДС из РеквизитТаблЗначений.Параметры.Элементы Цикл
		Если ТипЗнч(ПараметрДС.Значение)=Тип("Дата") Тогда
			РеквизитТаблЗначений.Параметры.УстановитьЗначениеПараметра(Строка(ПараметрДС.Параметр), ТекущаяДата());
		Иначе	
			РеквизитТаблЗначений.Параметры.УстановитьЗначениеПараметра(Строка(ПараметрДС.Параметр), "");
		КонецЕсли;	
	КонецЦикла;	
	Возврат ТаблицаФормы;
КонецФункции

Функция СозданиеДекорации(Форма, РодительДекорации, ВидДекорации, ИмяДекорации, ЗаголовокДекорации="", Картинка = Неопределено, РазместитьПередИмяЭлемента="") Экспорт
	Если РазместитьПередИмяЭлемента <> "" Тогда
		НоваяДекорация = Форма.Элементы.Вставить(ИмяДекорации, Тип("ДекорацияФормы"), РодительДекорации, РодительДекорации.ПодчиненныеЭлементы[РазместитьПередИмяЭлемента]);       
	Иначе
		НоваяДекорация = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), РодительДекорации); 
	КонецЕсли;		
	НоваяДекорация.Вид = ВидДекорации;
	НоваяДекорация.Заголовок = ЗаголовокДекорации;
	Если Картинка <> Неопределено Тогда
		НоваяДекорация.Картинка = Картинка;
	КонецЕсли;	
	Возврат НоваяДекорация;
КонецФункции

Функция СозданиеПоляФормы(Форма, ИмяЭлемента, РодительЭлемента, РазместитьПередИмяЭлемента="", ПутьКДанным=Неопределено, ВидЭлемента = Неопределено, Ширина = 0, Заголовок = Неопределено, ОтступПослеЗаголовка = Ложь, ШиринаЗаголовка = 0, РастягиватьПоГоризонтали = Неопределено) Экспорт
	Если ВидЭлемента = Неопределено Тогда 
		ВидЭлемента = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	Если РастягиватьПоГоризонтали = Неопределено Тогда
		РастягиватьПоГоризонтали = Ложь;
	КонецЕсли;
	Если ПутьКДанным = Неопределено Тогда
		ПутьКДанным = "Объект." + ИмяЭлемента; 
	КонецЕсли;
	Если ОтступПослеЗаголовка Тогда
		ГруппаЭлемента = СозданиеГруппыФормы(Форма, РодительЭлемента, ВидГруппыФормы.ОбычнаяГруппа, "Группа"+ИмяЭлемента, "", РазместитьПередИмяЭлемента, ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная, ОтображениеОбычнойГруппы.Нет);
		Если Заголовок <> Неопределено Тогда
			ЗаголовокДекорации = Заголовок;
		Иначе
			ЗаголовокДекорации = Форма.Объект.Ссылка.Метаданные().Реквизиты[ИмяЭлемента].Синоним;
		КонецЕсли;	
		НоваяДекорация = СозданиеДекорации(Форма, ГруппаЭлемента, ВидДекорацииФормы.Надпись, "Декорация"+ИмяЭлемента,ЗаголовокДекорации);   
		НоваяДекорация.Ширина = ШиринаЗаголовка;
		НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаЭлемента);
		НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	Иначе
		Если РазместитьПередИмяЭлемента = "" Тогда
			НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), РодительЭлемента);
		Иначе
			НовыйЭлемент = Форма.Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), РодительЭлемента, РодительЭлемента.ПодчиненныеЭлементы[РазместитьПередИмяЭлемента]);
		КонецЕсли;
	КонецЕсли;	
	НовыйЭлемент.Вид = ВидЭлемента; 
	Если ЕстьСвойство(НовыйЭлемент, "РастягиватьПоГоризонтали") Тогда
		НовыйЭлемент.РастягиватьПоГоризонтали = РастягиватьПоГоризонтали;	
	КонецЕсли;	
	НовыйЭлемент.ПутьКДанным = ПутьКДанным;
	Если Ширина <> 0 Тогда	
		НовыйЭлемент.Ширина = Ширина;
	КонецЕсли;	
	Если Заголовок <> Неопределено Тогда
		НовыйЭлемент.Заголовок = Заголовок;
	КонецЕсли;	
	Возврат НовыйЭлемент;
КонецФункции	

Функция ЕстьСвойство(Объект, ИмяСвойства) Экспорт
    РезультатФункции = Ложь;
    НачальноеЗНачение = Новый УникальныйИдентификатор();
    ЗначениеРеквизита = Новый Структура(ИмяСвойства, НачальноеЗНачение);
    ЗаполнитьЗначенияСвойств(ЗначениеРеквизита, Объект);
    Если ЗначениеРеквизита[ИмяСвойства] <> НачальноеЗНачение Тогда
        РезультатФункции = Истина;
    КонецЕсли;
    Возврат РезультатФункции;
КонецФункции

Функция ЕстьСвойствоОбъекта(Объект, ИмяСвойства) Экспорт
    ЕстьСвоство = Ложь;
    
    Структура = Новый Структура(ИмяСвойства, Неопределено);
    
    ЗаполнитьЗначенияСвойств(Структура, Объект);
    
    Если Структура[ИмяСвойства] = Неопределено Тогда
        Структура[ИмяСвойства] = Ложь;
        
        ЗаполнитьЗначенияСвойств(Структура, Объект);
        
        Если Структура[ИмяСвойства] <> Ложь Тогда
            ЕстьСвоство = Истина;
        КонецЕсли;
    Иначе
        ЕстьСвоство = Истина;
    КонецЕсли;
    
    Возврат ЕстьСвоство;
КонецФункции

#КонецОбласти